{"columns":["question","reply","expected_reply","sim","is_correct"],"data":[["What is the main plot of Inception?","The film follows Cobb, a professional thief who enters people’s dreams to steal or plant ideas. He is offered a chance to erase his criminal record if he can successfully implant an idea into a target’s subconscious—an operation that requires a team to navigate multiple dream levels while Cobb confronts the emotional fallout of his past.","Inception follows Dom Cobb, a thief who steals information by infiltrating the subconscious, as he is hired to plant an idea into a target's mind.",0.7458643913,true],["What company produced Inception?","It was produced by Warner Bros. Pictures in partnership with Legendary Pictures.","Inception was produced by Legendary Pictures and Syncopy and distributed by Warner Bros.",0.6072403193,false],["When was The Dark Knight released?","**The Dark Knight** opened in Australia and Taiwan on Wednesday, **July 16, 2008**, and was widely released in the United States and Canada on **July 18, 2008**.","The Dark Knight was released in 2008.",0.8140913248,true],["Who kills Rachel Dawes in The Dark Knight?","The Joker kills Rachel Dawes.","Rachel Dawes dies in an explosion set up by the Joker.",0.8685992956,true],["What is Deadpool’s real name in the film?","Deadpool’s real name in the film is **Wade Wilson**.","Deadpool’s real name is Wade Wilson.",0.9694764614,true],["Is Deadpool part of the Marvel Cinematic Universe (MCU)?","Yes. After Disney’s acquisition of 21st Century Fox, Deadpool’s film rights were returned to Marvel Studios, and the 2024 film *Deadpool & Wolverine* integrates both characters into the Marvel Cinematic Universe.","Deadpool is originally part of the X-Men universe by Fox, but he is expected to join the MCU following Disney’s acquisition of Fox.",0.6885359287,false],["What is the narrator's mental condition in Fight Club?","I cannot answer that question.","The narrator suffers from dissociative identity disorder, with Tyler Durden being an alternate personality.",0.1473714709,false],["Who are the main actors in Pulp Fiction?","The main actors in *Pulp Fiction* are John Travolta, Samuel L. Jackson, Bruce Willis, Tim Roth, Ving Rhames, and Uma Thurman.","The main actors include John Travolta, Samuel L. Jackson, Uma Thurman, and Bruce Willis.",0.7336191535,true],["Who is Butch Coolidge?","Butch Coolidge is the aging boxer who double‑crosses mob boss Marsellus Wallace and goes on the run. He is played by Bruce Willis in *Pulp Fiction*.","Butch Coolidge, played by Bruce Willis, is a boxer who double-crosses Marsellus Wallace by not throwing a fight.",0.8702528477,true]]}