{"columns":["question","reply","expected_reply","sim","is_correct"],"data":[["What is the main plot of Inception?","The film follows **Dom Cobb** (Leonardo DiCaprio), a professional “extractor” who uses shared‑dream technology to steal ideas from people’s subconscious. After a successful heist, a wealthy businessman, Saito, offers Cobb a seemingly impossible job: instead of stealing, he must **plant** an idea in the mind of Robert Fischer, the heir to a rival company, so that Fischer will break up his father’s business. The idea is to make Fischer believe that he needs to create something of his own.\n\nCobb assembles a team—Arthur, Eames, Yusuf, and the architect‑in‑training Ariadne—to plan a multi‑layered dream heist aboard an airplane. Each level of the dream runs slower than the one above it, and the team must time “kicks” (sudden jolts that wake dreamers) in sync to exit the dream safely. As they delve deeper, they face projections of Fischer’s subconscious, including an alter‑ego of his dead father and the terrifying “Limbo,” a shared unconscious space. The plot thickens when Cobb’s own memories of his late wife, Mal, surface, threatening to trap him in the dream forever. The team ultimately succeeds in implanting the idea, and Cobb confronts his guilt and attempts to return to his children. The film ends ambiguously with Cobb back home, unsure whether he is still in a dream.","Inception follows Dom Cobb, a thief who steals information by infiltrating the subconscious, as he is hired to plant an idea into a target's mind.",0.6138907671,false],["What company produced Inception?","The film was produced by Warner Bros. in partnership with Legendary Pictures.","Inception was produced by Legendary Pictures and Syncopy and distributed by Warner Bros.",0.5733046532,false],["When was The Dark Knight released?","The Dark Knight premiered on July 14 2008 in an IMAX showing in New York City and was widely released in the United States and Canada on July 18 2008.","The Dark Knight was released in 2008.",0.8244530559,true],["Who kills Rachel Dawes in The Dark Knight?","The Joker is the one who kills Rachel Dawes in *The Dark Knight*.","Rachel Dawes dies in an explosion set up by the Joker.",0.7477456331,true],["What is Deadpool’s real name in the film?","Deadpool’s real name is **Wade Wilson**.","Deadpool’s real name is Wade Wilson.",0.9866536856,true],["Is Deadpool part of the Marvel Cinematic Universe (MCU)?","Yes – the Deadpool franchise has been brought into the Marvel Cinematic Universe. After Disney’s acquisition of 21st Century Fox, the character’s film rights returned to Marvel Studios, and Deadpool & Wolverine (released July 26, 2024) was released as part of Phase Five of the MCU.","Deadpool is originally part of the X-Men universe by Fox, but he is expected to join the MCU following Disney’s acquisition of Fox.",0.6753715277,false],["What is the narrator's mental condition in Fight Club?","The narrator is portrayed as suffering from dissociative identity disorder (split‑personality) – an acute form of dissociation that is coupled with severe insomnia, depressive symptoms and a chronic sense of emptiness. This manifests in his creation of the alter‑ego Tyler Durden and the fragmented, unreliable perspective that drives the story.","The narrator suffers from dissociative identity disorder, with Tyler Durden being an alternate personality.",0.8744373322,true],["Who are the main actors in Pulp Fiction?","The main actors in *Pulp Fiction* are:\n\n- **John Travolta** as Vincent Vega  \n- **Samuel L. Jackson** as Jules Winnfield  \n- **Bruce Willis** as Butch Coolidge  \n- **Uma Thurman** as Mia Wallace  \n- **Ving Rhames** as Marsellus Wallace  \n- **Tim Roth** as Ringo (Pumpkin)  \n- **Amanda Plummer** as Yolanda (Honey Bunny)  \n\nThese performers carry the film’s three central storylines and its most iconic moments.","The main actors include John Travolta, Samuel L. Jackson, Uma Thurman, and Bruce Willis.",0.5382026434,false],["Who is Butch Coolidge?","Butch Coolidge is an aging boxer who is bribed by crime boss Marsellus Wallace to throw a fight. He double‑crosses Wallace, wins the bout, accidentally kills his opponent, and then becomes the central figure in the film’s revenge arc. The character is portrayed by Bruce Willis.","Butch Coolidge, played by Bruce Willis, is a boxer who double-crosses Marsellus Wallace by not throwing a fight.",0.9037110806,true]]}