{"columns":["question","reply","expected_reply","sim","is_correct"],"data":[["What is the main plot of Inception?","The film follows Cobb, a thief who specializes in “dream‑stealing” – stealing memories by infiltrating people’s subconscious. He is hired to perform the reverse: to plant an idea into a target’s mind (an “inception”). Cobb assembles a team and, by sharing a dream space and navigating several nested dream levels, attempts to implant a new idea while dealing with his own memories, the risk of becoming lost in the dream world, and the need to return to his children.","Inception follows Dom Cobb, a thief who steals information by infiltrating the subconscious, as he is hired to plant an idea into a target's mind.",0.7847011685,true],["What company produced Inception?","Inception was produced by Warner Bros. and Legendary.","Inception was produced by Legendary Pictures and Syncopy and distributed by Warner Bros.",0.9351916313,true],["When was The Dark Knight released?","The film opened in the United States and Canada on **July 18, 2008** (after a Wednesday opening in Australia and Taiwan on July 16, 2008).","The Dark Knight was released in 2008.",0.4852212965,false],["Who kills Rachel Dawes in The Dark Knight?","The Joker is responsible – he orchestrated the bomb that detonates and kills Rachel Dawes.","Rachel Dawes dies in an explosion set up by the Joker.",0.7483608127,true],["What is Deadpool’s real name in the film?","The film’s protagonist Deadpool’s real name is **Wade Wilson**.","Deadpool’s real name is Wade Wilson.",0.9385156035,true],["Is Deadpool part of the Marvel Cinematic Universe (MCU)?","Yes. After Disney’s acquisition of 21st Century Fox and the return of the X‑Men rights to Marvel Studios, the character was brought into the Marvel Cinematic Universe. The 2024 film “Deadpool & Wolverine” is released as part of Phase Five of the MCU, confirming Deadpool’s inclusion.","Deadpool is originally part of the X-Men universe by Fox, but he is expected to join the MCU following Disney’s acquisition of Fox.",0.7626287937,true],["What is the narrator's mental condition in Fight Club?","The narrator suffers from dissociative identity disorder (formerly known as multiple‑personality disorder). He is an unreliable narrator who, due to insomnia, dissociation, and a fractured sense of self, creates the alternate personality of Tyler Durden. This split‑personality condition drives the film’s central conflict and the narrator’s eventual confrontation with his own identity.","The narrator suffers from dissociative identity disorder, with Tyler Durden being an alternate personality.",0.9185307622,true],["Who are the main actors in Pulp Fiction?","The film’s principal cast includes:\n\n- **John Travolta** (Vincent Vega)  \n- **Samuel L. Jackson** (Jules Winnfield)  \n- **Bruce Willis** (Butch Coolidge)  \n- **Uma Thurman** (Mia Wallace)  \n- **Ving Rhames** (Marsellus Wallace)  \n- **Tim Roth** (Ezekiel W. Stokes)","The main actors include John Travolta, Samuel L. Jackson, Uma Thurman, and Bruce Willis.",0.8048549891,true],["Who is Butch Coolidge?","Butch Coolidge is the aging boxer who serves as one of the three central protagonists in Quentin Tarantino’s *Pulp Fiction*. In the film, he is hired by crime lord Marsellus Wallace to throw an upcoming fight, but he double‑crosses Wallace, wins the match, and then becomes the target of Wallace’s retaliation.  As the story unfolds, Butch navigates a series of tense and violent encounters—including a dangerous pawn‑shop showdown with Marsellus’s henchmen—while trying to secure a stolen gold watch from his father and ultimately leave Los Angeles with his girlfriend Fabienne.  The character is portrayed by Bruce Willis.","Butch Coolidge, played by Bruce Willis, is a boxer who double-crosses Marsellus Wallace by not throwing a fight.",0.8205812573,true]]}