{"columns":["question","reply","expected_reply","sim","is_correct"],"data":[["What is the main plot of Inception?","**Inception** follows Dom Cobb (Leonardo Di Caprio), a professional thief who specializes in “extraction” – stealing secrets by entering a target’s subconscious during their dreams. When a wealthy businessman offers Cobb a way to erase his criminal record, he is hired for a reverse‑process called “inception”: instead of stealing an idea, the team must plant one inside the target’s mind. The film follows Cobb and his crew as they navigate multiple layers of shared dream worlds, each level affecting the others, in an elaborate heist that blurs the line between reality and imagination.","Inception follows Dom Cobb, a thief who steals information by infiltrating the subconscious, as he is hired to plant an idea into a target's mind.",0.8793318272,true],["What company produced Inception?","Warner Bros. (in partnership with Legendary Pictures).","Inception was produced by Legendary Pictures and Syncopy and distributed by Warner Bros.",0.5078402758,false],["When was The Dark Knight released?","The Dark Knight was released in the United States and Canada on July 18, 2008.","The Dark Knight was released in 2008.",0.9122105837,true],["Who kills Rachel Dawes in The Dark Knight?","The Joker is the one who kills Rachel Dawes in *The Dark Knight*.","Rachel Dawes dies in an explosion set up by the Joker.",0.7477456331,true],["What is Deadpool’s real name in the film?","The film reveals Deadpool’s real name is **Wade Wilson**.","Deadpool’s real name is Wade Wilson.",0.944917202,true],["Is Deadpool part of the Marvel Cinematic Universe (MCU)?","Yes – the Deadpool character is now part of the Marvel Cinematic Universe. While the original 2016 film was released outside the MCU, the third film, *Deadpool & Wolverine* (2024), was produced by Marvel Studios and is set within the MCU’s Phase Five.","Deadpool is originally part of the X-Men universe by Fox, but he is expected to join the MCU following Disney’s acquisition of Fox.",0.6925637722,false],["What is the narrator's mental condition in Fight Club?","The context portrays the Narrator as someone struggling with **split personalities (a form of dissociative identity disorder)**.  He is unaware that he is mentally projecting Tyler Durden, and later realizes that he and Tyler are essentially two distinct personalities living in the same body.  In addition to this dissociative condition, he also suffers from chronic insomnia and the emotional turmoil that accompanies his attempt to cope with a life that feels meaningless.","The narrator suffers from dissociative identity disorder, with Tyler Durden being an alternate personality.",0.8372753859,true],["Who are the main actors in Pulp Fiction?","The principal actors who appear in *Pulp Fiction* are:\n\n- **John Travolta** (Vincent Vega)  \n- **Samuel L. Jackson** (Jules Winnfield)  \n- **Uma Thurman** (Mia Wallace)  \n- **Bruce Willis** (Butch Coolidge)  \n- **Tim Roth** (Ringo\/Pumpkin)  \n- **Ving Rhames** (Marsellus Wallace)  \n- **Harvey Keitel** (Winston Wolfe)  \n\nThese performers carry the film’s central characters and are considered its main cast.","The main actors include John Travolta, Samuel L. Jackson, Uma Thurman, and Bruce Willis.",0.5948418379,false],["Who is Butch Coolidge?","Butch Coolidge is the film’s prize‑fighter (boxer). He is one of the three central protagonists of *Pulp Fiction*, known for double‑crossing Marsellus Wallace by winning a staged fight, inadvertently killing his opponent, and later confronting Vincent Vega in the apartment. He is also the romantic interest of Fabienne and the character who ultimately retrieves and protects his father’s gold watch.","Butch Coolidge, played by Bruce Willis, is a boxer who double-crosses Marsellus Wallace by not throwing a fight.",0.7716507912,true]]}