{"columns":["question","reply","expected_reply","sim","is_correct"],"data":[["What is the main plot of Inception?","The film follows Dom Cobb (Leonardo DiCaprio), a professional “extractor” who steals information by infiltrating people’s subconscious minds through shared dream‑space technology. After a failed job that left him guilty over the death of his wife Mal, Cobb’s criminal record is cleared if he can successfully perform an “inception”: planting an idea in a target’s mind instead of extracting information. \n\nCobb is hired by industrialist Saito to implant the notion that Robert Fischer (Cillian Murphy) should dissolve his father’s company. To achieve this, Cobb assembles a team—Arthur (Joseph Gordon‑Levitt), forger‑Eames (Tom Hardy), chemist Yusuf (Dileep Rao), and architect‑student Ariadne (Elliot Page)—and sedates Fischer onto a plane. They then descend through three nested dream levels: a city, a hotel, and an alpine fortress, each with its own rules of time and reality. While each member must remain on a different level to provide synchronized “kicks” (stun stimuli that wake dreamers) and maintain the dream’s stability, they also confront Fischer’s subconscious defenses, including projections of his godfather Peter Browning and the dangerous figure of Mal.\n\nComplications arise when Yusuf’s sedative takes them into “Limbo,” a shared subconscious void where time stretches, forcing the team to improvise new kicks. During the descent, Mal’s projection kills Fischer, and both Saito and Fischer are lost in Limbo. Cobb must rescue them while ensuring the inception can be carried out. On the final level, Fischer receives the planted idea of creating something of his own. The team synchronizes their kicks to return to reality; Cobb confronts Saito and resolves his guilt over Mal. The film ends with Cobb finally reuniting with his children, choosing not to test the dream‑top “totem” and accepting that he has returned to the real world.","Inception follows Dom Cobb, a thief who steals information by infiltrating the subconscious, as he is hired to plant an idea into a target's mind.",0.6676424742,false],["What company produced Inception?","**Inception was produced by Warner Bros. Pictures in partnership with Legendary Pictures.**","Inception was produced by Legendary Pictures and Syncopy and distributed by Warner Bros.",0.8841048479,true],["When was The Dark Knight released?","The Dark Knight was released in the United States and Canada on **July 18, 2008**. (It began opening internationally on July 16, 2008.)","The Dark Knight was released in 2008.",0.8662643433,true],["Who kills Rachel Dawes in The Dark Knight?","The Joker kills Rachel Dawes.","Rachel Dawes dies in an explosion set up by the Joker.",0.8685992956,true],["What is Deadpool’s real name in the film?","Deadpool’s real name in the film is Wade Wilson.","Deadpool’s real name is Wade Wilson.",0.9755339622,true],["Is Deadpool part of the Marvel Cinematic Universe (MCU)?","Yes. After Disney’s acquisition of Fox, the Deadpool films were brought into Marvel Studios and the character is now part of the MCU, with the 2024 release of Deadpool & Wolverine serving as a Phase Five MCU entry.","Deadpool is originally part of the X-Men universe by Fox, but he is expected to join the MCU following Disney’s acquisition of Fox.",0.7671273947,true],["What is the narrator's mental condition in Fight Club?","The narrator exhibits symptoms of a dissociative identity disorder (split‑personality), presenting as an unreliable narrator who eventually realizes he and Tyler Durden are distinct, coexisting personalities.","The narrator suffers from dissociative identity disorder, with Tyler Durden being an alternate personality.",0.8904368877,true],["Who are the main actors in Pulp Fiction?","The principal actors in **Pulp Fiction** are:\n\n- **John Travolta** – as Vincent Vega  \n- **Samuel L. Jackson** – as Jules Winnfield  \n- **Bruce Willis** – as Butch Coolidge  \n- **Uma Thurman** – as Mia Wallace  \n- **Tim Roth** – as Winston (the gangster)  \n- **Ving Rhames** – as Marsellus Wallace  \n\nThese six performers carry the film’s central, interlocking storylines.","The main actors include John Travolta, Samuel L. Jackson, Uma Thurman, and Bruce Willis.",0.5874201059,false],["Who is Butch Coolidge?","Butch Coolidge is a prize‑fighter and one of the film’s three main protagonists. In the story he is an aging boxer who has double‑crossed Marsellus Wallace and is on the run, eventually getting involved in the violent events that unfold in the movie. He is portrayed by Bruce Willis.","Butch Coolidge, played by Bruce Willis, is a boxer who double-crosses Marsellus Wallace by not throwing a fight.",0.8966700435,true]]}