{"columns":["question","reply","expected_reply","sim","is_correct"],"data":[["What is the main plot of Inception?","**Main Plot of *Inception***  \nThe film centers on Dom Cobb (Leonardo DiCaprio), a skilled “extractor” who steals valuable information by infiltrating the subconscious of his targets. Cobb is offered a chance to have his criminal record erased if he can perform the reverse of his usual job: instead of stealing an idea, he must **implant** a new idea into the mind of a target—an act called *inception*. To pull off this complex heist, Cobb assembles a team and creates a layered dream‑world structure in which they must navigate multiple levels of sleeping minds. The story follows the team’s attempts to carry out the inception while grappling with personal guilt, memory, and the blurry line between dream and reality.","Inception follows Dom Cobb, a thief who steals information by infiltrating the subconscious, as he is hired to plant an idea into a target's mind.",0.7993517518,true],["What company produced Inception?","Inception was produced by Warner Bros. and Legendary Pictures.","Inception was produced by Legendary Pictures and Syncopy and distributed by Warner Bros.",0.9594319463,true],["When was The Dark Knight released?","The Dark Knight was released on **18 July 2008** in the United States and Canada (after opening in Australia and Taiwan on 16 July 2008).","The Dark Knight was released in 2008.",0.8711087704,true],["Who kills Rachel Dawes in The Dark Knight?","The Joker.","Rachel Dawes dies in an explosion set up by the Joker.",0.4406604469,false],["What is Deadpool’s real name in the film?","Deadpool’s real name in the film is Wade Wilson.","Deadpool’s real name is Wade Wilson.",0.9755339622,true],["Is Deadpool part of the Marvel Cinematic Universe (MCU)?","Yes. While the original *Deadpool* (2016) and *Deadpool 2* (2018) were produced by 20th Century Fox and were not part of the Marvel Cinematic Universe, the character’s film rights were returned to Marvel Studios after Disney’s acquisition of Fox. The third film, *Deadpool & Wolverine* (released July 26 2024), was created by Marvel Studios and is officially part of Phase Five of the MCU.","Deadpool is originally part of the X-Men universe by Fox, but he is expected to join the MCU following Disney’s acquisition of Fox.",0.6504437923,false],["What is the narrator's mental condition in Fight Club?","The narrator suffers from a combination of **insomnia, depression‑like existential angst, and a dissociative identity disorder** (manifested as the split personality Tyler Durden). The film portrays him as an unreliable narrator who initially does not realize that Tyler is a mental projection of his own fragmented psyche. His insomnia, chronic dissatisfaction with work and life, and the emergence of a separate personality lead to the violent, self‑destructive actions seen in the story.","The narrator suffers from dissociative identity disorder, with Tyler Durden being an alternate personality.",0.8285459876,true],["Who are the main actors in Pulp Fiction?","The main actors credited in *Pulp Fiction* are:\n\n- **John Travolta** (Vincent Vega)  \n- **Samuel L. Jackson** (Jules Winnfield)  \n- **Uma Thurman** (Mia Wallace)  \n- **Bruce Willis** (Butch Coolidge)  \n- **Tim Roth** (Ringo\/Pumpkin)  \n- **Ving Rhames** (Marsellus Wallace)","The main actors include John Travolta, Samuel L. Jackson, Uma Thurman, and Bruce Willis.",0.5807360411,false],["Who is Butch Coolidge?","Butch Coolidge is an aging, prize‑fighting boxer who is a central character in *Pulp Fiction*. In the film he double‑crosses crime boss Marsellus Wallace by winning a bout, but must then flee and confront the consequences of his actions. The role is played by Bruce Willis.","Butch Coolidge, played by Bruce Willis, is a boxer who double-crosses Marsellus Wallace by not throwing a fight.",0.8469828367,true]]}